Revit 2026 API

# DirectContext3DHandleOverrides Class

---

A set of DirectContext3DHandleSettings that are stored by a view.

SystemObject Autodesk.Revit.DB.DirectContext3DDirectContext3DHandleOverrides

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DirectContext3DHandleOverrides : IDisposable
```
```vb
Public Class DirectContext3DHandleOverrides
	Implements IDisposable
```
```cpp
public ref class DirectContext3DHandleOverrides : IDisposable
```
```fsharp
type DirectContext3DHandleOverrides =
    class
        interface IDisposable
    end
```

The DirectContext3DHandleOverrides type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Assign | Assigns values of the source overrides to this object. |
|  | Dispose | Releases all resources used by the DirectContext3DHandleOverrides |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDirectContext3DHandleSettings | Gets override settings associated with a DirectContext3D handle instance or type. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Check if the contents of two overrides are equal. |
|  | SetDirectContext3DHandleSettings | Assigns override settings associated with a DirectContext3D handle instance or type. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace